/* eslint-disable max-len */
import type { DistrictEventStoryList } from "@/types/StoryJson";

export const stories: DistrictEventStoryList = [
  {
    place: "shanhaijing",
    title: {
      TextJp: "五塵来降",
      TextCn: "五尘来降",
      TextKr: "오욕내강",
      TextTh: "อย่างตัวอย่าง",
      TextEn: "Descent of the Five Senses",
      TextTw: "五塵來降",
    },
    avatar:
      "https://yuuka.cdn.diyigemt.com/image/ba-all-data/UIs/03_Scenario/01_Background/CS/BG_CS_Event_31.webp",
    summary: {
      TextJp:
        "山海経の伝統行事「月影祭」が開催間近！\n……なのですが、準備会場の空気が不穏なうえ、奇妙な現象まで発生してしまい……？\n果たして月影祭は無事開催されるのでしょうか？",
      TextCn:
        "山海经的传统活动“月影祭”即将拉开帷幕！\n……然而，准备会场的气氛异常紧张，还发生了奇怪的现象……\n月影祭究竟能否顺利举行呢？",
      TextKr: "",
      TextTh: "",
      TextEn: "",
      TextTw: "",
    },
    sections: [
      {
        title: {
          TextJp: "祭りの準備",
          TextCn: "祭典的准备",
          TextKr: "축제를 준비합시다!",
          TextEn: "",
          TextTh: "",
          TextTw: "準備節慶",
        },
        story_id: 1003805,
        summary: {
          TextJp:
            "伝統行事「月影祭」に招待され、山海経を訪れた先生はミナ、キサキと再会する。昨今の不穏な空気を憂慮する生徒たちをよそに、キサキはいつもどおり月影祭を催行する意志を示すのだった。",
          TextCn:
            "老师受邀参加传统活动“月影祭”，并来到山海经，与弥奈和妃咲重逢。尽管学生们都为最近的紧张气氛感到担忧，但妃咲依然坚持按照惯例如期举办月影祭，展现了她坚定的意志。",
          TextKr: "선생님은 산해경 전통의 축제, 월영제에 초대받는다.",
          TextEn: "",
          TextTh: "",
          TextTw: "",
        },
        next: 1003810,
      },
      {
        title: {
          TextJp: "異変",
          TextCn: "异变",
          TextKr: "상서롭지 않은 이변",
          TextEn: "",
          TextTh: "",
          TextTw: "異變",
        },
        story_id: 1003810,
        previous: 1003805,
        next: 1003820,
        summary: {
          TextJp:
            "京劇部の一件でざわつく月影祭の準備会場にて、突如玄武商会のメンバーを中心に、生徒が幼くなる謎の現象が発生する。この「若返り現象」と同時に、記録を抹消されたはずの「申谷カイ」に関する噂も山海経全域へと広まっていく。",
          TextCn:
            "在因京剧部事件而变得纷乱的月影祭准备会场上，突然发生了以玄武商会成员为中心的学生们变得年幼的神秘现象。这种“返老还童现象”出现的同时，有关本应被抹去记录的“申谷海”的传闻也在山海经全域迅速传播开来。",
          TextKr:
            "현무상회를 중심으로, 학생들이 어려지는 현상이 산해경 전반으로 퍼져 나간다. 학생들 사이에서 카이에 대한 소문이 퍼지기 시작한다.",
          TextEn: "",
          TextTh: "",
          TextTw: "",
        },
      },
      {
        title: {
          TextJp: "噂",
          TextCn: "谣言",
          TextKr: "소문에 대처하는 자세",
          TextEn: "",
          TextTh: "",
          TextTw: "謠言",
        },
        story_id: 1003820,
        previous: 1003810,
        next: 1003830,

        summary: {
          TextJp:
            "申谷カイの噂と若返り現象は広まり続け止められそうにない。問題の早期解決が難しいと判断したキサキは、月影祭の開催を限定的なものにする裁決を下す。一方、先生も情報収集のためシュンと連絡をとる。すると事情を察した彼女は「シュエリン」の姿で、キサキと先生の前に現れたのだった。",
          TextCn:
            "有关申谷海的传闻以及“返老还童现象”继续蔓延，似乎难以阻止。妃咲判断问题无法在短期内解决，便决定将月影祭的举办范围限制在较小的规模。与此同时，老师为了收集更多情报，与瞬取得了联系。察觉到事态严重的瞬以“雪莲”的身份出现在妃咲和老师面前。",
          TextKr:
            "키사키는 산해경에 통제령을 내리지만, 어려지는 현상은 거침없이 퍼져 나가기만 한다. 매화원의 교관인 슌은, 어려진 모습으로 키사키를찾아온다.",
          TextEn: "",
          TextTh: "",
          TextTw: "",
        },
      },
      {
        story_id: 1003830,
        previous: 1003820,
        next: 1003840,
        title: {
          TextJp: "大人と子供、子供、子供。",
          TextCn: "大人和孩子、孩子，以及孩子。",
          TextKr: "어른과 아이, 아이, 아이.",
          TextEn: "",
          TextTh: "",
          TextTw: "大人與小孩，小孩，還有小孩。",
        },
        summary: {
          TextJp:
            "シュンの発案で梅花園の園児に扮して、山海経のあちこちで情報収集を始めるキサキたち。梅花園で若返り現象の影響を受けてしまったルミと会話する中で、敵の狙いは会長・サヤが不在の錬丹術研究会であることに気づく。",
          TextCn:
            "在瞬的提议下，妃咲等人乔装成梅花园的儿童，开始在山海经各处收集情报。与因“返老还童现象”变小的瑠美交谈时，他们意识到敌人的目标是会长沙耶不在的炼丹术研究会。",
          TextKr:
            "키사키와 슌은 어린아이의 모습으로 산해경 여기저기를 감찰한다.",
          TextEn: "",
          TextTh: "",
          TextTw: "",
        },
      },
      {
        is_before_battle: true,
        story_id: 1003840,
        previous: 1003830,
        next: 1003845,
        title: {
          TextJp: "過去と今の境界線（１）",
          TextCn: "过去与现在的分界线（1）",
          TextKr: "과거와 현재를 나누는 경계 1",
          TextEn: "",
          TextTh: "",
          TextTw: "過去與現在的分界線（１）",
        },
        summary: {
          TextJp:
            "サヤが不在の隙をついて錬丹術研究会へと帰還した申谷カイは、隠された研究室へと向かう。一方、襲撃を察知したキサキの指示でレイジョとミナが駆けつけたものの、そこにはブラックマーケットの傭兵が待ち構えており……。",
          TextCn: "趁沙耶不在之际，申谷海回到炼丹术研究会，径直前往隐藏的研究室。与此同时，察觉到袭击的妃咲指挥俪舒和弥奈赶往现场，然而在那里等待她们的却是黑市的雇佣兵……",
          TextKr: "카이가 마침내 산해경으로 돌아온다.",
          TextEn: "",
          TextTh: "",
          TextTw: "",
        },
      },
      {
        is_after_battle: true,
        story_id: 1003845,
        previous: 1003840,
        next: 1003850,
        title: {
          TextJp: "過去と今の境界線（２）",
          TextCn: "过去与现在的分界线（2）",
          TextKr: "과거와 현재를 나누는 경계 2",
          TextEn: "",
          TextTh: "",
          TextTw: "過去與現在的分界線（２）",
        },
        summary: {
          TextJp:
            "錬丹術研究会を掌握した申谷カイは、さっそく「仙丹」を作り上げた。早速服用したカイは、全身にみなぎる活力を感じながら怪しげに笑うのだった。",
          TextCn: "掌控了炼丹术研究会的申谷海迅速炼制出了“仙丹”。立刻服下仙丹后的她，感受到全身充满了澎湃的活力，随即露出一抹诡异的笑容。",
          TextKr: "카이가 연단방을 장악한다.",
          TextEn: "",
          TextTh: "",
          TextTw: "",
        },
      },
      {
        is_before_battle: true,
        title: {
          TextCn: "",
          TextKr: "너의 세계를 지나칠 때 1",
          TextJp: "君の世界との交差点（１）",
        },
        story_id: 1003850,
        previous: 1003845,
        next: 1003855,
        summary: {
          TextCn: "面对数量众多的敌人，俪舒和弥奈陷入苦战。妃咲带领玄龙门成员赶来成功解救了她们。然而就在此时，申谷海挡在了一行人面前。",
          TextKr: "키사키는 결국, 선단의 힘으로 강해진 카이에게 패배하고 만다.",
          TextJp:
            "あまりに多い敵を前に苦戦するレイジョとミナであったが、玄龍門の構成員を引き連れたキサキに窮地を救われた。しかし一行の前に、今度は申谷カイが立ちはだかる。",
        },
      },
      {
        is_after_battle: true,
        title: {
          TextCn: "",
          TextKr: "너의 세계를 지나칠 때 2",
          TextJp: "君の世界との交差点（２）",
        },
        story_id: 1003855,
        previous: 1003850,
        next: 1003860,
        summary: {
          TextCn: "获得仙丹之力的申谷海展现出强大的力量，打得众人节节败退。申谷海趁妃咲虚弱步步紧逼，煽动玄龙门成员和山海经的学生们的恐慌。虽然老师机智应对，避免了最坏的情况，但形势依然不利，妃咲等人最终只能选择逃离现场。",
          TextKr:
            "카이는 산해경 학생들을 선동하여 키사키를 규탄하고, 키사키는 크게 낙심한 채 모습을 감춘다.",
          TextJp:
            "仙丹の力を得た申谷カイの力を前に、一行は敗走を余儀なくされた。カイは弱ったキサキに追い打ちをかけるように、玄龍門の構成員や山海経の生徒たちの不安を煽りたてる。先生の機転で最悪の事態は回避するものの形勢は悪く、キサキたちはその場を逃げざるを得なかった。",
        },
      },
      {
        title: {
          TextCn: "",
          TextKr: "그 먼 훗날의 우리",
          TextJp: "遠い未来の私たち",
        },
        story_id: 1003860,
        previous: 1003855,
        next: 1003870,
        summary: {
          TextCn: "虽然申谷海击败了妃咲，但她对玄龙门的内情并无兴趣，转而专注于仙丹的研究。与此同时，玄龙门内部的强硬派开始抬头，并打算推举京剧部部长辉夜作为临时门主取代妃咲。面对这一提议，辉夜拒绝了担任门主的请求，但承诺会协助解决眼下的问题。她一边思索着妃咲曾独自背负的门主责任，一边着手应付当前局势。",
          TextKr:
            "카이로부터 시작된 혼돈이 산해경을 집어삼킨다. 현룡문의 강경파는 키사키를 실각시키고자 하고, 경극부의 부장 카구야를 임시로나마 그 자리에 앉히려 한다.",
          TextJp:
            "キサキを打倒したものの玄龍門の内情には興味がない申谷カイは、仙丹の研究に注力し始めた。一方、玄龍門では強硬派が台頭しており、キサキの代わりに京劇部の部長・カグヤを臨時の門主に擁立しようとする。話を持ち掛けられたカグヤは就任を断るものの、目下の問題の解決に向けて協力することを約束しつつ、門主の責任を一人背負っていたキサキに思いを馳せる。",
        },
      },
      {
        title: {
          TextCn: "",
          TextKr: "그곳에 가면 기린을 만날 수 있을까.",
          TextJp: "そこに行けば麒麟に会えるだろうか。",
        },
        story_id: 1003870,
        previous: 1003860,
        next: 1003880,
        summary: {
          TextCn: "老师与寄身于玄武商会的妃咲谈论了过去的种种以及她的真实想法。在交谈中，妃咲找到了自己应当做的事，并宣称一定要举办月影祭。此时，玄龙门的温和派成员赶来，再次向她宣誓效忠。",
          TextKr:
            "루미의 도움으로 피신한 키사키는, 선생님의 격려로 다시 일어선다. 현룡문의 온건파는 키사키를 찾아와, 다시 한번 충성을 맹세한다.",
          TextJp:
            "先生は玄武商会に身を寄せていたキサキと過去の出来事や彼女の真意について語らう。その中でキサキは己のなすべきことを見出し、月影祭を必ず開催すると宣言する。そこへ玄龍門の穏健派構成員がやってきて、改めて彼女に忠誠を誓うのだった。",
        },
      },
      {
        is_after_battle: true,
        title: {
          TextCn: "",
          TextKr: "천 번을 흔들릴 그대에게 1",
          TextJp: "幾度道を違えたとしても（１）",
        },
        story_id: 1003880,
        previous: 1003870,
        next: 1003885,
        summary: {
          TextCn: "妃咲准备返回玄龙门时，再次与辉夜相遇。两人就应当守护的传统展开了新的讨论。在讨论中，辉夜逐渐理解了妃咲的言辞确实合乎道理。于是，她请求妃咲击败自己以证明妃咲的正义，并希望妃咲能借此为山海经恢复秩序与传统。",
          TextKr: "키사키가 카구야를 직접 찾는다.",
          TextJp:
            "玄龍門へ帰還しようとするキサキと再び相まみえたカグヤ。守るべき伝統について改めて意見を交わす中で、キサキの言が道理に適っていると理解し、カグヤは自らを倒すことで正しさを証明し、山海経に秩序と伝統を取り戻してほしいと願う。",
        },
      },
      {
        is_after_battle: true,
        title: {
          TextCn: "",
          TextKr: "천 번을 흔들릴 그대에게 2",
          TextJp: "幾度道を違えたとしても（２）",
        },
        story_id: 1003885,
        previous: 1003880,
        next: 1003890,
        summary: {
          TextCn: "击败辉夜后，妃咲下令手下夺回六和阁，并带着弥奈一同前往地牢。",
          TextKr:
            "카구야는 자신을 쓰러트리고, 다시 한번 산해경의 질서와 전통을 되찾아 달라고 부탁한다.",
          TextJp:
            "カグヤを倒したキサキは六和閣の奪回を部下に命じると同時に、ミナを伴って地下牢へと向かう。",
        },
      },
      {
        is_before_battle: true,
        title: {
          TextCn: "",
          TextKr: "모든 번거로운 것들을 위하여 1",
          TextJp: "すべての面倒事を（１）",
        },
        story_id: 1003890,
        previous: 1003885,
        next: 1003895,
        summary: {
          TextCn: "为了在挑战炼丹术研究会之前释放沙耶，妃咲一行人前往地牢。然而，由于担心申谷海的要求以及担忧防止返老还童现象的药物会停止供应，狱卒拒绝释放沙耶。于是，妃咲宣誓将承担所有责任，并试图强行执行沙耶的释放命令。",
          TextKr: "키사키는 사야를 석방시키기 위해 감옥으로 향한다.",
          TextJp:
            "錬丹術研究会に挑む前にサヤを釈放するため、キサキたちは地下牢へと向かった。しかし申谷カイの要請や若返り現象を防ぐ薬の供給を止められる恐れから、看守はサヤの解放を拒む。そこでキサキは自身がすべての責任を負うことを宣言し、釈放の強制執行を試みる。",
        },
      },
      {
        is_after_battle: true,
        title: {
          TextCn: "",
          TextKr: "모든 번거로운 것들을 위하여 2",
          TextJp: "すべての面倒事を（２）",
        },
        story_id: 1003895,
        previous: 1003890,
        next: 1003900,
        summary: {
          TextCn: "平安释放了沙耶后，妃咲带领同伴前往炼丹术研究会。面对担忧自己身体状况的沙耶，妃咲露出了一抹意味深长的微笑。",
          TextKr:
            "사야를 석방시킨 키사키는, 모든 군세를 이끌고 카이에게로 향한다.",
          TextJp:
            "無事にサヤを釈放したキサキは、味方を引き連れ錬丹術研究会へと向かう。体調を気遣うサヤに対して、キサキは含みのある笑顔を見せる。",
        },
      },
      {
        is_before_battle: true,
        title: {
          TextCn: "",
          TextKr: "같은 하늘을 머리에 이고 1",
          TextJp: "同じ空の下で（１）",
        },
        story_id: 10038100,
        previous: 1003895,
        next: 10038105,
        summary: {
          TextCn: "妃咲再次面对申谷海。在对话中，妃咲直指海将责任不断推卸给他人的行为，指出她过去的被逐以及如今的困境都是自作自受。面对愤怒的海的挑衅，妃咲以玄龙门门主的身份再次向她发起挑战。",
          TextKr: "키사키와 카이의 최종 대결이 이루어진다.",
          TextJp:
            "改めて申谷カイと相対したキサキ。言葉を交わす中、責任を他人に押し付け続けるカイに対し、キサキはかつての追放も含め全てが自業自得であることを突きつける。怒りを覚えつつ挑発を続けるカイに、キサキは玄龍門の門主として再び戦いを挑む。",
        },
      },
      {
        title: {
          TextCn: "",
          TextKr: "같은 하늘을 머리에 이고 2",
          TextJp: "同じ空の下で（２）",
        },
        story_id: 0,
        previous: 0,
        next: 0,
        summary: {
          TextCn: "被自己引发的返老还童现象反噬，申谷海最终败在妃咲手下。尽管她对妃咲的态度提出诘难，但在老师回答了她之前提出的问题后，心情大好的海坦然接受了返老还童现象的处理方案，并同意再次被收监进矫正局。",
          TextKr: "카이에게 승리한 키사키는, 다시 한번 문주의 자리에 오른다.",
          TextJp:
            "自身の引き起こした若返り現象が仇となって、カイはキサキに敗北する。キサキの態度を非難しつつも、先生へ投げかけた質問に対する回答に機嫌を良くしたカイは、若返り現象の収拾と矯正局への再収監を素直に受け入れたのであった。",
        },
      },
      {
        title: {
          TextCn: "",
          TextKr: "축제를 시작합시다!",
          TextJp: "月影祭",
        },
        story_id: 10038110,
        previous: 10038105,
        summary: {
          TextCn: "返老还童现象得以顺利解决，月影祭也以历年相同的形式如期举行。伴随着俪舒、不断与老师联络的妃咲，以及那些笑容满面的学生们，老师尽情享受着这次月影祭的欢乐时光。",
          TextKr:
            "무사히 개최된 월영제에서, 선생님과 산해경의 학생들은 축제를 한껏 즐긴다.",
          TextJp:
            "若返り現象は無事収拾し、月影祭も予定どおり例年と同じ形で開催される運びとなった。レイジョや何度も連絡してくるキサキ、それに楽しげに笑う生徒たちと共に、先生は月影祭を満喫する。",
        },
      },
    ],
  },
];
