import { StoryBriefing } from '../types/StoryJson';

/* eslint-disable max-len */
export const stories: StoryBriefing[] = [
  {
    title: {
      TextJp: 'プロローグ',
      TextCn: '序章',
      TextKr: '프롤로그',
      TextTh: 'บทนำ',
      TextEn: 'Prologue',
      TextTw: '序章',
    },
    avatar: '/image/story_cover/prologue.webp',
    sections: [
      {
        title: {
          TextJp: 'プロローグ 1.1',
          TextCn: '序章 1.1',
          TextKr: '프롤로그 1.1',
          TextTh: 'บทนำ 1.1',
          TextEn: 'Prologue 1.1',
          TextTw: '序章 1.1',
        },
        story_id: 11000,
        summary: {
          TextKr:
            '기묘한 내용의 꿈으로부터 깨어난 직후, 선생님은 총학생회의 간부인 나나가미 린으로부터 총학생회장이 사라졌다는 소식을 전해 듣는다. 총학생회장의 실종으로 인해 학원도시 키보토스는 혼란에 휩싸이게 되고, 이 혼란을 해결하기 위해 선생님은 학생회 임원들과 함께 샬레 동아리실로 향한다.',
          TextJp:
            '奇妙な夢から目覚めた[USERNAME]先生は、連邦生徒会の幹部である七神リンから、連邦生徒会長がいなくなったということを聞かされる。連邦生徒会長の失踪により、現在ここ学園都市キヴォトスは混乱に包まれているのだという。この混乱を解決するため、[USERNAME]先生は生徒会の役員たちと共にシャーレの部室へと向かった。',
          TextTh:
            'หลังจากตื่นขึ้นมาจากฝันประหลาด คุณครูก็ได้ฟังข่าวจากนานากามิ ริน\nที่เป็นสมาชิกบริหารองค์การนักเรียนเรื่องที่ประธานองค์การนักเรียนหายตัวไป\nเนื่องจากประธานองค์การหายตัวไป เมืองแห่งการศึกษาคิโวทอสจึงเกิด\nความโกลาหลขึ้น และเพื่อแก้ไขสิ่งที่เกิดขึ้น คุณครูกับสภานักเรียนจึง\nมุ่งหน้าไปยังห้องชมรมชาเล่ต์',
          TextCn:
            '从奇怪的梦中醒来之后的[USERNAME]老师从联邦学生会的干部七神凛那里听到学生会长失踪的消息。由于学生会长失踪，学园城市基沃托斯陷入了混乱。为了解决这场混乱，老师和学生会的干部一同前往夏莱办公室。',
          TextTw:
            '從莫名其妙的夢中醒來之後，老師從總學生會的幹部七神凛那裡聽到總學生會長消失的消息。由於總學生會長失蹤，學園城市奇普托斯陷入混亂。為了解決這場混亂，老師和學生會的幹部一同前往夏萊社團室。',
          TextEn:
            'Sensei wakes from a bizarre dream and learns from Nanakami Rin that the General Student Council president is missing. The Academy City, Kivotos, is in chaos. Sensei heads to the Schale club room in an attempt to resolve the situation.',
        },
      },
    ],
  },
  {
    title: {
      TextJp: 'Vol.3 エデン条約編 1章',
      TextCn: 'Vol.3 伊甸条约篇 第1章',
      TextKr: 'Vol.3 에덴 조약편 1장',
      TextTh: 'Vol.3 สนธิสัญญาเอเดน ตอนที่ 1',
      TextEn: 'Vol.3 Eden Treaty Chapter 1',
      TextTw: 'Vol.3 伊甸條約篇 第1章',
    },
    avatar: '/image/story_cover/eden_treaty.webp',
    sections: [
      {
        title: {
          TextKr: '01 프롤로그',
          TextJp: '01 プロローグ',
          TextTh: '01 บทเริ่มต้น',
          TextTw: '01 序幕',
          TextEn: '01 Prologue',
          TextCn: '01 序章',
        },
        story_id: 31010,
        next: 31020,
        summary: {
          TextKr:
            '에덴조약이 가지는 의미와 일곱 화두, 그리고 낙원에 대해 이야기하는 세이아. 그녀는 선생님을 향해 지금부터 시작될 이야기는 당신의 의무이며, 부디 외면하지 말고 끝까지 확인해달라며 부탁한다.',
          TextJp:
            '「エデン条約」、「七つの古則」、そして「楽園」について語るセイア。彼女は先生に対して、どこか不穏な言葉を告げる。',
          TextTh:
            'เซอาพูดเกี่ยวกับสรวงสวรรค์และความหมายของสนธิสัญญาเอเดนกับ\nบัญญัติเจ็ดประการ เธอกล่าวกับคุณครูว่าเรื่องราวที่จะเริ่มต้น ตั้งแต่นี้คือ\nหน้าที่ของคุณครู และขอให้คุณครูเปิดใจและตรวจสอบเรื่องราวเหล่านี้',
          TextTw:
            '聖亞談論伊甸園條約具有的意義與七個古則以及和樂園。她對老師說，從現在開始要說的話是老師的義務，拜託老師千萬別逃避，一定要聽到最後。',
          TextEn:
            "Seia talks about the meaning of the Eden Treaty, the seven koans, and paradise. She asks Sensei to see the story through to the end, as Sensei is responsible for guiding the story that's about to begin.",
          TextCn:
            '圣娅正谈论“伊甸条约”、“七大古则”，以及“乐园”。她告诉老师，某些地方似乎不太平静。',
        },
      },
      {
        title: {
          TextKr: '02 보충수업부',
          TextJp: '02 補習授業部',
          TextTh: '02 ชมรมชั้นเรียนเสริม',
          TextTw: '02 補課部',
          TextEn: '02 Make-Up Work Club',
          TextCn: '02 补习部',
        },
        story_id: 31020,
        previous: 31010,
        next: 31030,
        summary: {
          TextKr:
            '코하루, 하나코, 아즈사, 그리고 히후미까지. 교실에 선생님과 네 명의 소녀들이 모였다. 퇴학 위기에 처했다며 소란을 피우는 코하루를 히후미가 진정시키는 사이, 이게 어찌 된 일인지. 선생님은 몇 주 전에 있던 일을 떠올린다.',
          TextJp:
            '教室には先生とヒフミ、ハナコ、アズサ、そしてコハルが集まっていた。このままだと退学だと騒ぐコハルをヒフミが落ち着かせる様子を見ながら、先生は事の発端である数週間前のことを思い返す。',
          TextTh:
            'โคฮารุ ฮานาโกะ อาซึสะ ฮิฟุมิ นักเรียนทั้ง 4 คนและคุณครูได้มารวม\nตัวกันที่ห้องเรียน ฮิฟุมิช่วยปลอบโคฮารุที่กำลังโวยวาย เพราะเรื่องที่\nจะถูกไล่ออกจากโรงเรียนกัน คุณครูพยายามคิดว่าเกิดเรื่องอะไรขึ้น\nและก็นึกถึงเรื่องเมื่อหลายสัปดาห์ก่อนขึ้นมาได้',
          TextTw:
            '小春、花子、梓，以及日步美。老師和四名少女聚集在教室裡。小春鬧著說自己處於退學危機。在日步美讓她冷靜下來的時候，這到底是怎麼回事？老師回想幾週前發生的事。',
          TextEn:
            "Sensei and four girls—Koharu, Hanako, Azusa, and Hifumi—gather in the classroom. While Hifumi calms Koharu, who's freaking out over being on the verge of expulsion, Sensei has a peculiar recollection of an event a few weeks ago.",
          TextCn:
            '教室里聚集了小春、花子、梓、日富美和老师。看着日富美让吵着“再这样下去就要被退学了”的小春冷静下来的样子，老师回想起几周前发生的，一切事情的开端。',
        },
      },
      {
        title: {
          TextKr: '03 티파티',
          TextJp: '03 ティーパーティー',
          TextTh: '03 สภาน้ำชา',
          TextTw: '03 茶會',
          TextEn: '03 Tea Party',
          TextCn: '03 茶会',
        },
        story_id: 31030,
        previous: 31020,
        next: 31040,
        summary: {
          TextKr:
            '트리니티의 학생회장들인 나기사와 미카의 초대를 받고 티파티에 출석한 선생님. 낙제 위기에 처한 보충수업부 학생들을 맡기고 싶다는 나기사의 제안에 선생님은 승낙한다. 그렇게 해서 찾은 곳에서 선생님은 보충수업부의 부장인 히후미와 재회한다.',
          TextJp:
            'トリニティの生徒会長であるナギサとミカに誘われ、ティーパーティーに顔を出した先生。落第寸前の生徒たちが集まる「補習授業部」の担任になってほしいと頼まれ、それを承諾することに。その補習授業部の名簿の中には見知った名前があり、まさかと思いつつ教室に向かった先生は、部長であるヒフミと再会するのだった。',
          TextTh:
            'คุณครูเข้าร่วมงานสภาน้ำชาตามคำเชิญของมิกะและนางิสะ ประธานสภา\nนักเรียนโรงเรียนทรีนิตี้ คุณครูเห็นด้วยกับคำแนะนำของนางิสะเรื่องการ\nรับมอบหมายให้ดูแลนักเรียนชมรมชั้นเรียนเสริมที่เสี่ยงต่อการถูกไล่ออก\nจากโรงเรียน และที่นั่นคุณครูก็พบกับฮิฟุมิที่เป็นหัวหน้าชมรม',
          TextTw:
            '受聖三一學生會長的渚與未花的邀請，動身前往聖三一學園的老師接受了兩人的請求。答應擔任成績岌岌可危學生們所聚集的「補課部」的班導師。補課部的名冊中記錄著老師認識的學生名，內心帶著一絲莫非念頭的老師來到教室，與身為補課部社長的日富美再度重逢。',
          TextEn:
            'Sensei attends a tea party at the invitation of Nagisa and Mika, the Student Council presidents of Trinity. Nagisa proposes Sensei handle the Make-Up Work Club students who are at risk of failing and Sensei agrees. At the club, Sensei is reunited with Hifumi, the president of the Make-Up Work Club.',
          TextCn:
            '在圣三一的学生会长渚与未花的邀请下，老师出席了茶会。渚提出希望老师负责面临留级危机的补课部学生，老师答应了。在补课部的名单中，老师看到了一个熟悉的名字。来到教室后，老师果然看见了补习部的部长日富美。',
        },
      },
      {
        title: {
          TextKr: '04 낙제생들 1',
          TextJp: '04 補習授業部の生徒たち（１）',
          TextTh: '04 นักเรียนที่สอบตก 1',
          TextTw: '04 補課部的學生們（１）',
          TextEn: '04 Failing Students Part 1',
          TextCn: '04 补习部的学生们（1）',
        },
        story_id: 31040,
        previous: 31030,
        next: 31050,
        summary: {
          TextKr:
            '히후미를 따라 우선 보충수업부의 학생들을 만나기로 결정한 선생님은 미풍양속을 어긴 끝에 정의실현부에게 구금된 하나코와 정의실현부와 교전 끝에 잡혀 온 아즈사와 만난다.',
          TextJp:
            'ヒフミと共に、補習授業部の残りのメンバーに会いに行くことにした先生。二人は正義実現委員会に監禁されていた「ハナコ」、そして正義実現委員会との交戦の末に捕らえられた「アズサ」と出会う。',
          TextTh:
            'คุณครูตัดสินใจจะไปพบกับกลุ่มสมาชิกชมรมชั้นเรียนเสริมก่อนจึงได้ตาม\nฮิฟุมิไป และพบฮานาโกะที่ถูกทางชมรมทวงความยุติธรรมควบคุมตัวไว้\nกับอาซึสะที่ถูกจับกุมตัวหลังจากก่อเหตุปะทะกับชมรมทวงความยุติธรรม',
          TextTw:
            '老師決定跟著日步美，先去見補課部的學生，並在此時遇到因違背良俗而被實現正義部拘禁的花子，以及與實現正義部交戰後被抓來的梓。',
          TextEn:
            'Sensei follows Hifumi to meet the students of the Make-Up Work Club. Sensei meets Hanako, who is detained by the Justice Task Force due to disorderly conduct, and Azusa, who was caught after a fight with the Justice Task Force.',
          TextCn:
            '老师决定跟着日富美一起去见见补习部的其他学生。二人在正义实现委员会找到了被监禁的花子，以及与委员会大战一场后被制服的梓。',
        },
      },
      {
        title: {
          TextKr: '05 낙제생들 2',
          TextJp: '05 補習授業部の生徒たち（２）',
          TextTh: '05 นักเรียนที่สอบตก 2',
          TextTw: '05 補課部的學生們（２）',
          TextEn: '05 Failing Students Part 2',
          TextCn: '05 补习部的学生们（2）',
        },
        story_id: 31050,
        previous: 31040,
        next: 31060,
        summary: {
          TextKr:
            '하나코와 아즈사의 신병을 넘겨받고자 하는 선생님에게 코하루는 보충수업부라니 부끄럽고 불쌍하다며 야유하지만, 실은 코하루도 유급 위기로 인해 보충수업부로 소속이 옮겨진 상태였다. 좌절하는 코하루를 끝으로 모든 보충수업부 학생들이 한자리에 모인다.',
          TextJp:
            'ハナコとアズサを引き渡してもらおうとする先生だったが、正義実現委員会であるコハルに反発されてしまう。先輩であるハスミに説得されながら「補習授業部なんて恥ずかしい」と揶揄うコハルだったが、彼女もまた補習授業部のメンバーになることが発覚。コハルは自分の発言によるダメージを引きずりつつも、ようやく補習授業部のメンバーが全員揃うことに。',
          TextTh:
            'โคฮารุบ่นคุณครูเรื่องความน่าอับอาย และความน่าสมเพชของชมรมชั้น\nเรียนเสริม แต่ที่จริงแล้วโคฮารุเองก็ถูกย้ายมาอยู่ที่ชมรมชั้นเรียนเสริม\nเพราะเธอสอบตก ถึงแม้จะโคฮารุจะรู้สึกสิ้นหวัง แต่สุดท้ายเธอก็ได้รวบ\nรวมสมาชิกของชมรมชั้นเรียนเสริมมาครบทุกคน',
          TextTw:
            '小春對著想把花子和梓接出來的老師奚落說，補課部既丟臉又可憐。但其實小春也因為留級危機而被轉入補課部了。加上挫折的小春，所有補課部學生都齊聚一堂。',
          TextEn:
            'Koharu expresses pity for Hanako and Azusa when Sensei takes them to the Make-Up Work Club. However it turns out Koharu has also been transferred to the Make-Up Work Club because of her failing grades. Finally, all of the students of the Make-Up Work Club gather, including a frustrated Koharu.',
          TextCn:
            '对于老师想把花子与梓带走的举动，正义实现委员会的小春反应十分激烈。前辈莲见学姐尝试说服小春时，小春揶揄道“加入补习部丢死人了”，结果发现自己也是补习部的一员。尽管小春自己也被自己的发言波及到，但补习部的成员总算到齐了。',
        },
      },
      {
        title: {
          TextKr: '06 자기소개의 시간',
          TextJp: '06 自己紹介をしましょう！',
          TextTh: '06 เวลาสำหรับการแนะนำตัว',
          TextTw: '06 來自我介紹吧！',
          TextEn: '06 Breaking the Ice',
          TextCn: '06 来做一下自我介绍吧！',
        },
        story_id: 31060,
        previous: 31050,
        next: 31070,
        summary: {
          TextKr:
            '보충수업부에 모인 학생들은 각자 이 자리에 모인 이유와 앞으로의 목표를 이야기한다. 시험에서 낙제하여 유급되지 않도록 협력하자는 말에, 코하루는 어차피 금방 끝날 관계이니 협력 같은 건 필요 없다며 먼저 자리를 떠나버린다.',
          TextJp:
            'あらためて一堂に会した補習授業部。「三回中一回でも『全員同時に』合格すればOK」というルールが提示されつつ、軽い自己紹介の流れから、各々の事情が微かに明らかになる。それではみんなで頑張って乗り越えよう……という流れの中、コハルは「私はエリートだから！こんなところすぐに出てってやるから！」と自信満々に口にするのだった。',
          TextTh:
            'สมาชิกชมรมชั้นเรียนเสริมบอกสาเหตุที่ตัวเองถูกย้ายมาอยู่ที่ชมรมนี้\nและเล่าถึงเป้าหมายในอนาคตให้คุณครูฟัง หลังจากคุณครูขอความ\nร่วมมือทุกคนไม่ให้สอบตก โคฮารุกลับปฏิเสธโดยบอกว่าไม่จำเป็น\nเพราะอีกไม่นานความสัมพันธ์ในชมรมนี้ก็จะจบลงในไม่ช้า',
          TextTw:
            '聚集在補課部的學生，各自訴說自己來到這裡的原因，以及未來的目標。當小春聽到「為了不讓因為考試不及格而留級的情況發生，請大家合作」這句話，便說反正這段關係很快就會結束，自己才不需要合作。說完就先離開了。',
          TextEn:
            "The Make-Up Work Club members each share their reasons for being there and their goals for the future. When asked to cooperate with the others so they don't fail the exam, Koharu leaves, she won't be in the club for long so there's no point cooperating.",
          TextCn:
            '补习部成员重新聚在一起。在向大家说明“只要三次考试中‘大家同时’及格一次就可以了”的规则的同时，成员们进行了简单的自我介绍，稍微了解了大家的情况。然而在“大家一起加油度过难关吧”……的过程中，小春却自信满满地说“我可是精英！很快就能从这里离开了！”。',
        },
      },
      {
        title: {
          TextKr: '07 시험 준비',
          TextJp: '07 試験勉強',
          TextTh: '07 เตรียมตัวสอบ',
          TextTw: '07 準備考試',
          TextEn: '07 Exam Prep',
          TextCn: '07 准备考试',
        },
        story_id: 31070,
        previous: 31060,
        next: 31080,
        summary: {
          TextKr:
            '선생님의 감독 아래, 1차 시험을 준비하는 보충수업부의 학생들. 하나코의 해박한 지식 덕분에 준비는 좋은 분위기로 흐르지만, 히후미가 혹시라도 1차부터 한 명이라도 낙제생이 생기면 합숙에 들어가야 한다며 앞일을 걱정하는 사이, 그렇게 첫 번째 시험이 시작된다.',
          TextJp:
            '先生に勉強を教えてもらったりお互いに教え合ったりしながら、一次試験に向けて準備をする補習授業部の生徒たち。アズサの学習意欲は高く、ハナコもどうやら博識で、コハルは（自称）余裕とのこと。全体的に良い空気で進んでいる中、ヒフミの口から「一次試験で不合格者が出たら強制的に合宿」という事実が密かに発覚する。',
          TextTh:
            'สมาชิกชมรมเตรียมพร้อมต่อการสอบครั้งแรกภายใต้การดูแลของคุณครู\nด้วยความรอบรู้ในหลายๆ ด้านของฮานาโกะ ทำให้ผ่านไปได้อย่างราบรื่น\nฮิฟุมิกังวลว่าหากมีคนสอบตกก็จะต้องมีการเข้าแคมป์ฝึกฝน และเธอก็\nต้องเข้าสอบครั้งแรกไปพร้อมกับความกังวลนั้น',
          TextTw:
            '在老師的監督下，準備第一輪考試的補課部的學生們。多虧花子淵博的知識，準備考試的氣氛很融洽。但是日步美說，只要第一輪考試有一個學生不及格就必須合宿。就在她為將來的事擔心時，第一場考試就這麼開始了。',
          TextEn:
            "Under Sensei's supervision, Make-Up Work Club members prepare for the first exam. Thanks to Hanako's extensive knowledge, the preparation goes smoothly, but Hifumi is worried that if even one student fails the first exam, they will all forced into a study boot camp. And, at last, the first exam begins.",
          TextCn:
            '补习部的学生们一边互相帮助一边向老师请教，为迎接第一次考试做准备。梓十分热衷于学习，花子也似乎博学多才，而小春则（自认为）非常从容。总的来说氛围十分良好，日富美却透露出了“如果第一次考试有不及格者就要强制合宿”的实情。',
        },
      },
      {
        title: {
          TextKr: '08 제1차 평가 시험',
          TextJp: '08 第1次特別学力試験',
          TextTh: '08 การสอบประเมินครั้งที่ 1',
          TextTw: '08 第1次特別學力測驗',
          TextEn: '08 The First Evaluation Exam',
          TextCn: '08 第一次特别学力考试',
        },
        story_id: 31080,
        previous: 31070,
        next: 31090,
        summary: {
          TextKr:
            '시험을 치르며, 다행히도 시험 준비 때 공부했던 문제가 나온 걸 확인한 히후미는 안심한다. 그러나 제1차 평가 시험 결과, 히후미를 뺀 보충수업부의 남은 세 명이 전부 낙제해버리며, 보충수업부의 합숙이 결정된다.',
          TextJp:
            '試験が始まる中、今まで勉強した内容がそのまま出ており、試験自体の難易度もかなり低いことに安堵するヒフミ。しかし、蓋を開けてみると、ヒフミ以外の全員が不合格。補習授業部の合宿開催が決まるのだった。',
          TextTh:
            'ฮิฟุมิโล่งใจหลังเห็นโจทย์ในข้อสอบเป็นโจทย์ที่เคยฝึกทำมาแล้วในตอน\nเรียนเสริม แต่ผลการสอบประเมินครั้งแรกปรากฎว่า นอกจากฮิฟุมิแล้ว\nสมาชิกอีกสามคนที่เหลือต่างก็สอบตกทั้งหมด ทำให้สมาชิกชมรมชั้น\nเรียนเสริมตัดสินใจเข้าแคมป์ฝึกฝน',
          TextTw:
            '在考試途中，日步美發現考題出的是之前準備考試時學過的內容，於是便放下心來。然而第一輪評鑑考試的結果，除了日步美以外，其他三名補課部成員全部不及格。因此補課部合宿的事就這麼定了。',
          TextEn:
            'Hifumi is relieved to see the questions she studied are on the exam. However, the other three students of the Make-Up Work Club all fail the exam, and the Make-Up Work Club has to join the boot camp.',
          TextCn:
            '考试开始后，日富美发现考试内容与之前学过的一模一样，而且难度也相当低，松了一大口气。然而当考试成绩揭晓时，除了日富美之外的所有人都没有及格。于是补习部接下来需要进行合宿。',
        },
      },
      {
        title: {
          TextKr: '09 수면 아래의 것들',
          TextJp: '09 水面下に揺らめく影',
          TextTh: '09 สิ่งที่ซ่อนอยู่เบื้องลึก',
          TextTw: '09 水面下搖曳的影子',
          TextEn: '09 What Lurks in the Depths',
          TextCn: '09 暗流涌动',
        },
        story_id: 31090,
        previous: 31080,
        next: 31100,
        summary: {
          TextKr:
            '선생님은 나기사에게 보충수업부의 학생들이 낙제하게 되면 어떻게 될지 묻는다. 그러면 퇴학 조치가 될 것이며, 보충수업부는 원래부터 그러기 위한 동아리라고 충격적인 대답을 하는 나기사. 이는 전부 트리니티의 배신자를 찾기 위해 꾸민 일이었으며, 나기사는 보충수업부에 배신자가 있을 것이라 경고한다.',
          TextJp:
            '先生はナギサに、補習授業部の生徒たちが三回とも試験に通らなかったらどうなるのか、と尋ねる。その場合はもちろん「全員退学」であり、そもそも補習授業部は最初から生徒を退学させるための部活だと告げるナギサ。エデン条約の締結を妨害しようとする「裏切り者」、それが補習授業部の中にいるはず。ナギサは先生に対し、その裏切り者を探してほしいと口にするが……。',
          TextTh:
            'คุณครูสอบถามนางิสะถึงผลที่จะเกิดขึ้นหากสมาชิกชมรมชั้นเรียนเสริม\nทั้งสามคนสอบตกอีก เธอตอบว่าหากทั้งสามคนสอบตกอีกก็จะถูกไล่ออก\nเพราะชมรมถูกก่อตั้งมาเพื่อวัตถุประสงค์นี้ และเพื่อค้นหานักเรียนที่ทรยศ\nต่อโรงเรียนทรีนิตี้ และเตือนคุณครูว่ามีคนทรยศอยู่ในชมรม',
          TextTw:
            '老師問渚，如果補課部的學生考試不及格會怎樣。然而渚的回答卻讓人大為震驚。她說，這麼一來就會採取退學措施，而且補課部本來就是以此為目的的社團。這全都是為了找出三一學園的背叛者而設計的，渚還警告說補課部應該有背叛者。',
          TextEn:
            "Sensei asks Nagisa what will happen if the Make-Up Work Club members flunk. Nagisa reveals that the intended function of the Make-Up Work Club is guide students to expulsion. This has all been part of a plan designed to find Trinity's traitor, and Nagisa warns that she must be in the Make-Up Work Club.",
          TextCn:
            '老师询问渚，如果学生们三次考试都没有通过结果会如何。渚回答道她们自然会被“全部退学”，并告诉老师补习部一开始就是为了让学生退学而设置的社团。渚认为补习部中有一个企图阻止伊甸条约签订的“叛徒”，并对老师说希望老师找出这个叛徒。',
        },
      },
      {
        title: {
          TextKr: '10 합숙, 시작합니다!',
          TextJp: '10 合宿、スタート！',
          TextTh: '10 เริ่มแคมป์ฝึกฝน!',
          TextTw: '10 合宿，開始！',
          TextEn: '10 Boot Camp, Here We Come!',
          TextCn: '10 合宿，开始！',
        },
        story_id: 31100,
        previous: 31090,
        next: 31110,
        summary: {
          TextKr:
            '시험 합숙을 위해 보충수업부는 트리니티 외곽의 별관을 찾는다. 본격적인 합숙을 시작하기 전부터 여러 기행을 벌이는 보충수업부 멤버들이었지만, 여러 해프닝 끝에 우선 보충수업부는 별관을 청소하기로 결정한다.',
          TextJp:
            '合宿を行うため、トリニティの別館を訪れた補習授業部一同。到着直後からバタバタの彼女たちだったが、何はともあれまずは掃除から始めようということになる。',
          TextTh:
            'ชมรมชั้นเรียนเสริมเดินทางไปยังอาคารย่อยในแถบชานเมืองของทรีนิตี้\nเพื่อเข้าแคมป์ฝึกฝนสำหรับการสอบ สมาชิกชมรมชั้นเรียนเสริมทำ\nพฤติกรรมแปลกๆ ตั้งแต่ก่อนเริ่มแคมป์ฝึกฝน แต่เมื่อจบเรื่องต่างๆ แล้ว\nชมรมชั้นเรียนเสริมก็ตัดสินใจที่จะความสะอาดอาคารย่อยก่อน',
          TextTw:
            '為了執行考前合宿計畫，補課部特地前往位於三一學園外圍的別館。雖然在正式開始合宿之前，補課部就已經鬧出了許多令人啼笑皆非的插曲，但是在諸多因素的考量之下，她們決定先一起把別館打掃乾淨。',
          TextEn:
            'The Make-Up Work Club goes to an annex located on the outskirts of Trinity for boot camp and high jinks ensue. After much discussion, they decide to clean the annex first.',
          TextCn:
            '为了进行合宿，补习部全体成员动身前往圣三一的分馆。虽然她们一到达就开始忙碌了起来，但首先还是要从大扫除开始。',
        },
      },
      {
        title: {
          TextKr: '11 대청소!',
          TextJp: '11 大掃除！',
          TextTh: '11 ทำความสะอาดครั้งใหญ่!',
          TextTw: '11 大掃除！',
          TextEn: '11 Spring Cleaning!',
          TextCn: '11 大扫除！',
        },
        story_id: 31110,
        previous: 31100,
        next: 31120,
        summary: {
          TextKr:
            '대청소를 하던 중, 하나코는 본격적으로 공부하기 전에 함께 물놀이를 하자며 야외수영장도 청소할 것을 제안한다. 그렇게 청소를 하며 모두들 흠뻑 물에 젖는다.',
          TextJp:
            '一通りの掃除を終えた後、ハナコがプールを掃除して水遊びをしようと提案する。本格的な勉強を始める前にとそれぞれ着替えた後、びしょびしょに濡れながら全員でプール掃除を始めるのだった。',
          TextTh:
            'ในระหว่างที่ทำความสะอาดครั้งใหญ่ ฮานาโกะก็ชวนทุกคนเล่นน้ำก่อน\nจะเริ่มเรียนอย่างจริงจัง และเสนอให้ทำความสะอาดสระว่ายน้ำกลางแจ้ง\nด้วย ทุกคนช่วยกันทำความสะอาดอย่างเปียกปอน',
          TextTw:
            '在大掃除的時候，花子表示在正式開始讀書之前應該先去玩水，於是便提議順便連戶外游泳池也一起打掃。就這樣，補課部的成員們一邊打掃，一邊打起了水仗。',
          TextEn:
            'Hanako wants to have fun in the water with everyone before officially beginning their studies and suggests cleaning the outdoor swimming pool. Everyone gets soaked in water as they start cleaning.',
          TextCn:
            '彻底打扫一遍之后，花子提议清理泳池后玩一会水。在开始正式学习之前，大家换好了衣服，一起湿淋淋地清理游泳池。',
        },
      },
      {
        title: {
          TextKr: '12 합숙의 첫날 밤',
          TextJp: '12 合宿初日の夜',
          TextTh: '12 คืนแรกในแคมป์ฝึกฝน',
          TextTw: '12 合宿初日的夜晚',
          TextEn: '12 First Night of Boot Camp',
          TextCn: '12 合宿第一天的夜晚',
        },
        story_id: 31120,
        previous: 31110,
        next: 31130,
        summary: {
          TextKr:
            '늦은 밤. 히후미는 상담을 위해 선생님을 찾는다. 트리니티의 배신자를 찾으라는 나기사의 말에 괴로워하는 히후미지만, 선생님은 걱정 말고 자신에게 맡겨달라 말한다. 그러는 사이 불침번을 자청해 서는 아즈사와 하나코가 잠시 이야기를 나누며, 합숙 첫날 밤이 지나간다.',
          TextJp:
            '初日の夜、ヒフミは先生の元を訪れた。ナギサとの間にあった会話の内容を聞き、先生はヒフミに対して「その件は任せて」と告げる。ほぼ同時刻、見張りをしていたアズサとハナコが鉢合わせて……。',
          TextTh:
            'ฮิฟุมิมาหาคุณครูเพื่อขอคำปรึกษาในกลางดึก เธอทุกข์ใจที่นางิสะบอก\nให้หาตัวคนทรยศในทรีนิตี้ แต่คุณครูก็บอกไปว่าอย่ากังวล และให้ฝาก\nเรื่องนี้ให้ตนจัดการ ในขณะนั้นเองอาซึสะและฮานาโกะก็ได้พูดคุยกัน\nระหว่างที่ยืนเฝ้ายามกลางดึก และคืนแรกของแคมป์ฝึกฝนก็ล่วงเลยไป',
          TextTw:
            '為了商量一些事，日步美和老師在夜裡見了一面。日步美向老師表示渚吩咐她想辦法揪出三一的叛徒，但此事卻令她相當苦惱。老師一邊安撫日步美，一邊告訴她自己會想辦法解決這件事。與此同時，自願站夜哨的梓和花子有一搭沒一搭地聊著天，而合宿的第一夜也就在她們的聊天聲中匆匆地結束了。',
          TextEn:
            "Hifumi, troubled by Nagisa's request to find Trinity's traitor, visits Sensei late at night for advice. Sensei tells her not to worry and focus on helping in her own way. Meanwhile, Azusa and Hanako chat for a while during Azusa's night watch.",
          TextCn:
            '大家一同合宿的第一天晚上，日富美去找了老师。听了她与渚之间的对话内容后，老师告诉日富美，“那件事就交给我吧”。几乎同时，正在夜巡的梓与花子相遇了……',
        },
      },
      {
        title: {
          TextKr: '13 제1차 모의시험',
          TextJp: '13 補習授業部の模擬試験',
          TextTh: '13 การสอบเสมือนจริงครั้งที่ 1',
          TextTw: '13 補課部的模擬測驗',
          TextEn: '13 First Mock Exam',
          TextCn: '13 补习部的模拟考试',
        },
        story_id: 31130,
        previous: 31120,
        next: 31140,
        summary: {
          TextKr:
            '합숙 첫 모의시험의 결과는 또다시 히후미를 뺀 전원의 낙제였다. 그러나 히후미는 좌절하지 않고 모두를 합격시키겠다고 선언하며, 좋은 성적을 거둔 이에겐 모모프렌즈 굿즈를 상품으로 주겠다고 말한다. 시큰둥해하는 하나코나 코하루와 달리, 아즈사는 귀엽다며 눈을 빛낸다.',
          TextJp:
            'ヒフミは自分にできることをしようと模擬試験を作成するものの、結果はヒフミ以外惨敗。それでもその後の対策を練り、さらに良い成績を収めた場合はモモフレンズのグッズをプレゼントすると宣言する。微妙な反応をするハナコとコハルだったが、アズサの目は輝き始め……？',
          TextTh:
            'ทุกคนสอบตกในการสอบเสมือนจริงครั้งแรกของแคมป์ฝึกฝนยกเว้นฮิฟุมิ\nแต่ฮิฟุมิก็ไม่ถอดใจและบอกว่าจะช่วยให้ทุกคนสอบผ่านให้ได้ เธอบอกว่า\nจะให้สินค้า MOMO FRIENDS กับคนที่ได้คะแนนดี ฮานาโกะกับโคฮารุ\nไม่สนใจของของฮิฟุมิ แต่อาซึสะบอกว่าน่ารักและทำตาเป็นประกาย',
          TextTw:
            '雖然除了日步美以外，補課部的所有成員都沒通過第一次模擬考，但日步美卻沒有因此而洩氣。日步美不但發誓要讓所有人通過考試，甚至還承諾要買Momo好友周邊商品送給在考試中取得好成績的成員。與面露不屑的花子和小春相反，梓不僅覺得那些周邊商品很可愛，眼神中還透露著滿滿的渴望。',
          TextEn:
            'The first camp mock exam scores are tallied. Everyone failed except Hifumi again. Instead of being discouraged, Hifumi declares that she will help everyone, promising Momo Friends prizes for good grades. Azusa is the only one excited by the prospect.',
          TextCn:
            '日富美尽自己所能，尝试出了一份模拟考卷，但除了她以外的三人都表现惨淡。尽管如此，她依然继续制定了进一步的对策，并宣布取得更好的成绩的人将获得她送出的MOMO FRIENDS周边作为奖品。虽然花子和小春对此的反应有些微妙，但梓的眼睛却开始闪闪发光……？',
        },
      },
      {
        title: {
          TextKr: '14 정의실현부의 부부장 1',
          TextJp: '14 正義実現委員会の副委員長（１）',
          TextTh: '14 รองหัวหน้าชมรมทวงความยุติธรรม 1',
          TextTw: '14 實現正義部的副部長（１）',
          TextEn: '14 Justice Task Force Vice President Part 1',
          TextCn: '14 正义实现委员会的副委员长（1）',
        },
        story_id: 31140,
        previous: 31130,
        next: 31150,
        summary: {
          TextKr:
            '자율학습 도중 다른 학생들에게 야한 책을 들킨 코하루, 그녀는 당황하며 이건 어디까지나 자기도 모르게 가져온 압류품이라고 변명한다. 이걸 되돌려놓기 위해 코하루는 선생님과 함께 정의실현부 부실로 향한다.',
          TextJp:
            '自習の途中、カバンの中にエッチな本を入れていたことがバレてしまったコハル。しかしそれは正義実現委員としての活動中の押収品で、間違えて持っていたとのこと。騒ぎになる前に戻しておいた方が良いという話になり、コハルと先生は正義実現委員会の教室へと向かうことになるのだった。',
          TextTh:
            'โคฮารุถูกนักเรียนคนอื่นจับได้ว่ามีหนังสือผู้ใหญ่ในระหว่างการทบทวนบทเรียน เธอตระหนกและอ้างว่าเป็นของที่ยึดมาได้และพกมาแบบไม่รู้ตัว โคฮารุกับคุณครูจึงมุ่งหน้าไปยังชมรมทวงความยุติธรรมเพื่อเอาหนังสือไปคืน',
          TextTw:
            '補課部的成員發現小春在自習時間偷看色情書刊，而小春則急忙推說那本色情書刊只是她不小心帶來的沒收品。為了將那本書物歸原主，小春和老師一同前往實現正義部部室。',
          TextEn:
            "The other students find Koharu with an inappropriate book during study time. Flustered, Koharu makes an excuse, saying it's a confiscated item that she brought by mistake. Koharu heads to the Justice Task Force club room with Sensei.",
          TextCn:
            '在自习期间，小春被大家发现包里有色情读物。然而那本书是正义实现委员会行动中没收的物品，被小春错带到了补习部。为防止事态进一步扩大，大家决定先把书放回原处。于是小春和老师一起前往正义实现委员会的教室。',
        },
      },
      {
        title: {
          TextKr: '15 정의실현부의 부부장 2',
          TextJp: '15 正義実現委員会の副委員長（２）',
          TextTh: '15 รองหัวหน้าชมรมทวงความยุติธรรม 2',
          TextTw: '15 實現正義部的副部長（２）',
          TextEn: '15 Justice Task Force Vice President Part 2',
          TextCn: '15 正义实现委员会的副委员长（2）',
        },
        story_id: 31150,
        previous: 31140,
        next: 31160,
        summary: {
          TextKr:
            '코하루의 필사적인 변명에, 선생님은 코하루는 코하루다운 걸로 괜찮다 말해준다. 그 배려에 코하루는 보답으로 자신이 정의실현부의 첩보원이라는 비밀을 알려준다. 이후 정의실현부에서 하스미와 비밀 대화를 나눈 코하루는 선생님과 함께 합숙소로 복귀한다.',
          TextJp:
            'あらためて慌てて先生に説明するコハルに対し、先生は「無理に縛られなくても大丈夫」と口にする。それを受けてコハルは、実は自分はスパイなのだと先生に告白をすることに。その後、押収品を無事に戻したところでハスミと遭遇し、彼女は何やらコハルと内緒の話を始めるのだが……？',
          TextTh:
            'โคฮารุแก้ตัวอย่างสิ้นหวัง แต่คุณครูก็บอกกับโคฮารุว่าให้เป็นตัวเองได้\nโคฮารุซึ้งใจจนตอบแทนด้วยการบอกความลับกับคุณครูว่าตัวเองคือหน่วย\nข่าวกรองของชมรมทวงความยุติธรรม เมื่อโคฮารุได้คุยเรื่องความลับกับ\nฮาสุมิที่ชมรมทวงความยุติธรรมเสร็จก็กลับแคมป์ฝึกฝนมาพร้อมกับคุณครู',
          TextTw:
            '雖然小春不停為自己辯解，但老師卻對此事相當不以為意，甚至還鼓勵她勇敢地做自己。為了報答老師的體貼，小春將自己是實現正義部的間諜一事告訴了老師。和蓮實在實現正義部內交頭接耳了一會後，小春便跟著老師一起回到了別館。',
          TextEn:
            "Sensei tells Koharu that it's okay for her to be herself. To return Sensei's kindness, Koharu reveals that she is a spy for the Justice Task Force. Koharu returns to camp with Sensei after a secret conversation with Hasumi.",
          TextCn:
            '惴惴不安的小春又对老师解释了一遍，然而老师却说“不必过于勉强自己”。听到老师这么说之后，小春便向老师坦白了自己其实是间谍的事实。将没收来的物品平安归还之后，小春遇到了莲见，后者与小春开始了一番秘密谈话……？',
        },
      },
      {
        title: {
          TextKr: '16 작은 틈새',
          TextJp: '16 小さな隙間',
          TextTh: '16 โอกาสเล็กๆ',
          TextTw: '16 小小的閒隙',
          TextEn: '16 Crack in the Surface',
          TextCn: '16 小小的间隙',
        },
        story_id: 31160,
        previous: 31150,
        next: 31170,
        summary: {
          TextKr:
            '수영복과 속옷은 구분할 수 없다는 하나코의 말에, 아즈사는 그건 다섯 번째 화두라며 알은체를 한다. 그 말에 깜짝 놀라 동요하는 하나코. 히후미는 하나코가 원래는 뛰어난 수재였으나, 일부러 시험을 망치고 있다는 사실을 알고 혼란스러워하는 사이, 다음날, 갑작스레 미카가 선생님을 찾아온다.',
          TextJp:
            'ハナコとコハルの会話の途中、「七つの古則」のことを口にするアズサ。そのことに対し、ハナコはかなり驚いた様子を見せていた。その日の夜、ヒフミは先生の元を訪れ、模試の作成中に知ってしまったとある事実を告げる。その内容は、ハナコは間違いなく秀才であり、彼女はわざと試験に失敗しているとしか思えないというものだった。そんな混乱の翌朝、ミカが先生のもとを訪れて……。',
          TextTh:
            'ฮานาโกะไม่สามารถแยกแยกระหว่างชุดว่ายน้ำกับชุดชั้นในได้ อาซึสะ\nบอกไปว่านั่นคือกฎโบราณข้อที่ 5 ฮานาโกะได้ยินแบบนั้นจึงตกใจและ\nกระสับกระส่าย ฮิฟุมิตกใจที่ได้รู้ความจริงว่าฮานาโกะคือนักเรียนหัวกะทิ\nแต่ตั้งใจสอบให้ไม่ผ่านเอง ส่วนในวันรุ่งขึ้นมิกะก็มาหาคุณครูที่แคมป์',
          TextTw:
            '聽到花子說自己無法分辨泳裝和內衣的區別時，梓便立刻跳出來宣布這件事將成為第五個古則，並且擺出一副萬事通的高傲姿態。聽完梓說的話，花子在震驚之餘也開始有點動搖。得知花子明明天資聰穎，卻總是故意搞砸考試的事情後，日步美的腦袋頓時陷入了混亂。隔天，彌香突然出現在老師面前。',
          TextEn:
            'Hanako pontificates the difference between underwear and swimsuits as Azusa makes the connection to it being similar to the fifth koan. Hifumi learns that Hanako is a brilliant student deliberately tanking her exams. Mika suddenly visits Sensei the next day.',
          TextCn:
            '在花子与小春对话途中，梓突然提到了关于“七大古则”的事情。花子对此表现得十分震惊。那天晚上，日富美去了老师的房间，告诉了老师她在出模拟考卷时发现的某个事实：花子毫无疑问是个尖子生，她似乎是故意让自己在考试中不及格的。经历如此混乱之后，未花在早上拜访了老师……。',
        },
      },
      {
        title: {
          TextKr: '17 트리니티의 배신자',
          TextJp: '17 トリニティの裏切り者',
          TextTh: '17 คนทรยศในทรีนิตี้',
          TextTw: '17 三一的叛徒',
          TextEn: "17 Trinity's Traitor",
          TextCn: '17 圣三一的叛徒',
        },
        story_id: 31170,
        previous: 31160,
        summary: {
          TextKr:
            '미카는 선생님에게 이미 나기사와 선생님 사이에 어떤 이야기가 오갔는지 알고 있으니 트리니티의 배신자를 알려주겠다며 거래를 제안한다. 배신자는 다름 아닌 아즈사이며, 거래의 조건으로 미카는 바로 그 아즈사를 지켜달라 말한다.',
          TextJp:
            'ナギサとの間にあった会話について触れつつ、ミカは先生に対して取引を持ちかけ、「トリニティの裏切り者」を教えてあげると告げる。その名は「白洲アズサ」。ミカは続けて、アズサを守ってほしいと口にするのだった。',
          TextTh:
            'มิกะบอกว่ารู้ว่าเกิดเรื่องอะไรขึ้นบ้างระหว่างนางิสะกับคุณครู และเสนอข้อ\nแลกเปลี่ยนว่าจะบอกว่าใครคือคนทรยศในทรีนิตี้ คนทรยศที่ว่าคืออาซึสะ\nเงื่อนไขของมิกะคือการขอให้คุณครูช่วยปกป้องอาซึสะ',
          TextTw:
            '彌香表示自己知道渚和老師私底下聊了些什麼，而且只要老師願意和她做交易，她就告訴老師三一的叛徒究竟是誰。彌香告訴老師，叛徒不是別人，就是梓。但作為交易的條件她要求老師好好保護梓。',
          TextEn:
            "Claiming to already know what kind of talk went on between Nagisa and Sensei, Mika offers Sensei a deal to reveal the identity of Trinity's traitor. The traitor is none other than Azusa, and in exchange, Mika asks that Sensei protect Azusa at all costs.",
          TextCn:
            '未花提及老师与渚之间的交流，并提出与老师进行交易，并告诉老师“圣三一的叛徒”的名字叫白洲梓。未花接着说，希望老师能保护梓。',
        },
      },
    ],
  },
];
